/* # ***** BEGIN LICENSE BLOCK ***** */
/* # Version: MPL 1.1/GPL 2.0/LGPL 2.1 */
/* # */
/* # The contents of this file are subject to the Mozilla Public License Version */
/* # 1.1 (the \"License\"); you may not use this file except in compliance with */
/* # the License. You may obtain a copy of the License at */
/* # http://www.mozilla.org/MPL/ */
/* # */
/* # Software distributed under the License is distributed on an \"AS IS\" basis, */
/* # WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License */
/* # for the specific language governing rights and limitations under the */
/* # License. */
/* # */
/* # The Original Code is mozilla.org code. */
/* # */
/* # The Initial Developer of the Original Code is */
/* # Netscape Communications Corporation. */
/* # Portions created by the Initial Developer are Copyright (C) 2001 */
/* # the Initial Developer. All Rights Reserved. */
/* # */
/* # Contributor(s): */
/* # */
/* # Alternatively, the contents of this file may be used under the terms of */
/* # either of the GNU General Public License Version 2 or later (the \"GPL\"), */
/* # or the GNU Lesser General Public License Version 2.1 or later (the \"LGPL\"), */
/* # in which case the provisions of the GPL or the LGPL are applicable instead */
/* # of those above. If you wish to allow use of your version of this file only */
/* # under the terms of either the GPL or the LGPL, and not to allow others to */
/* # use your version of this file under the terms of the MPL, indicate your */
/* # decision by deleting the provisions above and replace them with the notice */
/* # and other provisions required by the GPL or the LGPL. If you do not delete */
/* # the provisions above, a recipient may use your version of this file under */
/* # the terms of any one of the MPL, the GPL or the LGPL. */
/* # */
/* # ***** END LICENSE BLOCK ***** */

/* # Map Expat error codes to error strings */
"1" = "out of memory";
"2" = "syntax error";
"3" = "no element found";
"4" = "not well-formed";
"5" = "unclosed token";
"6" = "partial character";
"7" = "mismatched tag";
"8" = "duplicate attribute";
"9" = "junk after document element";
"10" = "illegal parameter entity reference";
"11" = "undefined entity";
"12" = "recursive entity reference";
"13" = "asynchronous entity";
"14" = "reference to invalid character number";
"15" = "reference to binary entity";
"16" = "reference to external entity in attribute";
"17" = "XML or text declaration not at start of entity";
"18" = "unknown encoding";
"19" = "encoding specified in XML declaration is incorrect";
"20" = "unclosed CDATA section";
"21" = "error in processing external entity reference";
"22" = "document is not standalone";
"23" = "unexpected parser state";
"24" = "entity declared in parameter entity";
"27" = "prefix not bound to a namespace";
"28" = "must not undeclare prefix";
"29" = "incomplete markup in parameter entity";
"30" = "XML declaration not well-formed";
"31" = "text declaration not well-formed";
"32" = "illegal character(s) in public id";
"38" = "reserved prefix (xml) must not be undeclared or bound to another namespace name";
"39" = "reserved prefix (xmlns) must not be declared or undeclared";
"40" = "prefix must not be bound to one of the reserved namespace names";

/* # %1$S is replaced by the Expat error string, may be followed by Expected (see below) */
/* # %2$S is replaced by URL */
/* # %3$u is replaced by line number */
/* # %4$u is replaced by column number */
"XMLParsingError" = "XML Parsing Error: %1$S\nLocation: %2$S\nLine Number %3$u, Column %4$u:";

/* # %S is replaced by a tag name. */
/* # This gets appended to the error string if the error is mismatched tag. */
"Expected" = ". Expected: </%S>.";
